Revit 2027 API
ProjectBrowserOptions.GetProjectBrowserOptions Method
 Returns the current Revit instance's ProjectBrowserOptions.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ProjectBrowserOptions GetProjectBrowserOptions()
Public Shared Function GetProjectBrowserOptions As ProjectBrowserOptions
public:
static ProjectBrowserOptions^ GetProjectBrowserOptions()
static member GetProjectBrowserOptions : unit -> ProjectBrowserOptions
Return Value
ProjectBrowserOptions
 The ProjectBrowserOptions for the current Revit instance.
See Also
Reference
ProjectBrowserOptions Class
Autodesk.Revit.UI Namespace